Microchip-MPLAB-Harmony/csp_apps_pic32cm_sg00_gc00/apps/tcc/tcc_timer_mode/firmware/src/packs/PIC32CM5112GC00100_DFP/component/wft.h
/*
 * Component description for WFT
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version  */
#ifndef _PIC32CMGC00_WFT_COMPONENT_H_
#define _PIC32CMGC00_WFT_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR WFT                                          */
/* ************************************************************************** */

/* -------- WFT_WFCON1 : (WFT Offset: 0x00) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON1_RESETVALUE                 _UINT16_(0x00)                                       /*  (WFT_WFCON1) Wafer Flash Test Control Register  Reset Value */

#define WFT_WFCON1_ADDRINC_Pos                _UINT16_(0)                                          /* (WFT_WFCON1) Address Auto-Increment Enable bit Position */
#define WFT_WFCON1_ADDRINC_Msk                (_UINT16_(0x1) << WFT_WFCON1_ADDRINC_Pos)            /* (WFT_WFCON1) Address Auto-Increment Enable bit Mask */
#define WFT_WFCON1_ADDRINC(value)             (WFT_WFCON1_ADDRINC_Msk & (_UINT16_(value) << WFT_WFCON1_ADDRINC_Pos)) /* Assigment of value for ADDRINC in the WFT_WFCON1 register */
#define WFT_WFCON1_DATAINV_Pos                _UINT16_(1)                                          /* (WFT_WFCON1) Data Invert Enable bit Position */
#define WFT_WFCON1_DATAINV_Msk                (_UINT16_(0x1) << WFT_WFCON1_DATAINV_Pos)            /* (WFT_WFCON1) Data Invert Enable bit Mask */
#define WFT_WFCON1_DATAINV(value)             (WFT_WFCON1_DATAINV_Msk & (_UINT16_(value) << WFT_WFCON1_DATAINV_Pos)) /* Assigment of value for DATAINV in the WFT_WFCON1 register */
#define WFT_WFCON1_DAT2ADR_Pos                _UINT16_(2)                                          /* (WFT_WFCON1) Compare golden data (WFRDATA) will use the address of data being rea Position */
#define WFT_WFCON1_DAT2ADR_Msk                (_UINT16_(0x1) << WFT_WFCON1_DAT2ADR_Pos)            /* (WFT_WFCON1) Compare golden data (WFRDATA) will use the address of data being rea Mask */
#define WFT_WFCON1_DAT2ADR(value)             (WFT_WFCON1_DAT2ADR_Msk & (_UINT16_(value) << WFT_WFCON1_DAT2ADR_Pos)) /* Assigment of value for DAT2ADR in the WFT_WFCON1 register */
#define WFT_WFCON1_RMODE_Pos                  _UINT16_(3)                                          /* (WFT_WFCON1) Data Read Mode bits Position */
#define WFT_WFCON1_RMODE_Msk                  (_UINT16_(0x3) << WFT_WFCON1_RMODE_Pos)              /* (WFT_WFCON1) Data Read Mode bits Mask */
#define WFT_WFCON1_RMODE(value)               (WFT_WFCON1_RMODE_Msk & (_UINT16_(value) << WFT_WFCON1_RMODE_Pos)) /* Assigment of value for RMODE in the WFT_WFCON1 register */
#define WFT_WFCON1_DBG_EN_Pos                 _UINT16_(6)                                          /* (WFT_WFCON1) Debug Status Enable Bit   (See Note 1 - VALID in Pin Mode ONLY) Position */
#define WFT_WFCON1_DBG_EN_Msk                 (_UINT16_(0x1) << WFT_WFCON1_DBG_EN_Pos)             /* (WFT_WFCON1) Debug Status Enable Bit   (See Note 1 - VALID in Pin Mode ONLY) Mask */
#define WFT_WFCON1_DBG_EN(value)              (WFT_WFCON1_DBG_EN_Msk & (_UINT16_(value) << WFT_WFCON1_DBG_EN_Pos)) /* Assigment of value for DBG_EN in the WFT_WFCON1 register */
#define WFT_WFCON1_FP_CLK_EN_Pos              _UINT16_(7)                                          /* (WFT_WFCON1) Flash Panel Clock Enable Bit Position */
#define WFT_WFCON1_FP_CLK_EN_Msk              (_UINT16_(0x1) << WFT_WFCON1_FP_CLK_EN_Pos)          /* (WFT_WFCON1) Flash Panel Clock Enable Bit Mask */
#define WFT_WFCON1_FP_CLK_EN(value)           (WFT_WFCON1_FP_CLK_EN_Msk & (_UINT16_(value) << WFT_WFCON1_FP_CLK_EN_Pos)) /* Assigment of value for FP_CLK_EN in the WFT_WFCON1 register */
#define WFT_WFCON1_WIDTH16_Pos                _UINT16_(8)                                          /* (WFT_WFCON1) Wafer Test Data Out Bus Width  (See Note 1 - VALID in Pin Mode ONLY) Position */
#define WFT_WFCON1_WIDTH16_Msk                (_UINT16_(0x1) << WFT_WFCON1_WIDTH16_Pos)            /* (WFT_WFCON1) Wafer Test Data Out Bus Width  (See Note 1 - VALID in Pin Mode ONLY) Mask */
#define WFT_WFCON1_WIDTH16(value)             (WFT_WFCON1_WIDTH16_Msk & (_UINT16_(value) << WFT_WFCON1_WIDTH16_Pos)) /* Assigment of value for WIDTH16 in the WFT_WFCON1 register */
#define WFT_WFCON1_LAS_EN_Pos                 _UINT16_(9)                                          /* (WFT_WFCON1) Logical Address Scrambling Enable bit Position */
#define WFT_WFCON1_LAS_EN_Msk                 (_UINT16_(0x1) << WFT_WFCON1_LAS_EN_Pos)             /* (WFT_WFCON1) Logical Address Scrambling Enable bit Mask */
#define WFT_WFCON1_LAS_EN(value)              (WFT_WFCON1_LAS_EN_Msk & (_UINT16_(value) << WFT_WFCON1_LAS_EN_Pos)) /* Assigment of value for LAS_EN in the WFT_WFCON1 register */
#define WFT_WFCON1_VREFOE_Pos                 _UINT16_(10)                                         /* (WFT_WFCON1) Voltage Reference Output Enable bit Position */
#define WFT_WFCON1_VREFOE_Msk                 (_UINT16_(0x1) << WFT_WFCON1_VREFOE_Pos)             /* (WFT_WFCON1) Voltage Reference Output Enable bit Mask */
#define WFT_WFCON1_VREFOE(value)              (WFT_WFCON1_VREFOE_Msk & (_UINT16_(value) << WFT_WFCON1_VREFOE_Pos)) /* Assigment of value for VREFOE in the WFT_WFCON1 register */
#define WFT_WFCON1_EXTVREF_VREFDIS_Pos        _UINT16_(11)                                         /* (WFT_WFCON1) Voltage Reference Source Selection bit ) Position */
#define WFT_WFCON1_EXTVREF_VREFDIS_Msk        (_UINT16_(0x1) << WFT_WFCON1_EXTVREF_VREFDIS_Pos)    /* (WFT_WFCON1) Voltage Reference Source Selection bit ) Mask */
#define WFT_WFCON1_EXTVREF_VREFDIS(value)     (WFT_WFCON1_EXTVREF_VREFDIS_Msk & (_UINT16_(value) << WFT_WFCON1_EXTVREF_VREFDIS_Pos)) /* Assigment of value for EXTVREF_VREFDIS in the WFT_WFCON1 register */
#define WFT_WFCON1_STP_ERR_Pos                _UINT16_(12)                                         /* (WFT_WFCON1) Stop on Compare Error Enable bit Position */
#define WFT_WFCON1_STP_ERR_Msk                (_UINT16_(0x1) << WFT_WFCON1_STP_ERR_Pos)            /* (WFT_WFCON1) Stop on Compare Error Enable bit Mask */
#define WFT_WFCON1_STP_ERR(value)             (WFT_WFCON1_STP_ERR_Msk & (_UINT16_(value) << WFT_WFCON1_STP_ERR_Pos)) /* Assigment of value for STP_ERR in the WFT_WFCON1 register */
#define WFT_WFCON1_CNT_ERR_Pos                _UINT16_(13)                                         /* (WFT_WFCON1) Compare Error Counting enable bit. Position */
#define WFT_WFCON1_CNT_ERR_Msk                (_UINT16_(0x1) << WFT_WFCON1_CNT_ERR_Pos)            /* (WFT_WFCON1) Compare Error Counting enable bit. Mask */
#define WFT_WFCON1_CNT_ERR(value)             (WFT_WFCON1_CNT_ERR_Msk & (_UINT16_(value) << WFT_WFCON1_CNT_ERR_Pos)) /* Assigment of value for CNT_ERR in the WFT_WFCON1 register */
#define WFT_WFCON1_TM01OE_Pos                 _UINT16_(14)                                         /* (WFT_WFCON1) TM0 and TM1 Output Enable Position */
#define WFT_WFCON1_TM01OE_Msk                 (_UINT16_(0x1) << WFT_WFCON1_TM01OE_Pos)             /* (WFT_WFCON1) TM0 and TM1 Output Enable Mask */
#define WFT_WFCON1_TM01OE(value)              (WFT_WFCON1_TM01OE_Msk & (_UINT16_(value) << WFT_WFCON1_TM01OE_Pos)) /* Assigment of value for TM01OE in the WFT_WFCON1 register */
#define WFT_WFCON1_VPPDIVOE_Pos               _UINT16_(15)                                         /* (WFT_WFCON1) VPPDIV Output Enable Position */
#define WFT_WFCON1_VPPDIVOE_Msk               (_UINT16_(0x1) << WFT_WFCON1_VPPDIVOE_Pos)           /* (WFT_WFCON1) VPPDIV Output Enable Mask */
#define WFT_WFCON1_VPPDIVOE(value)            (WFT_WFCON1_VPPDIVOE_Msk & (_UINT16_(value) << WFT_WFCON1_VPPDIVOE_Pos)) /* Assigment of value for VPPDIVOE in the WFT_WFCON1 register */
#define WFT_WFCON1_Msk                        _UINT16_(0xFFDF)                                     /* (WFT_WFCON1) Register Mask  */

#define WFT_WFCON1_WIDTH_Pos                  _UINT16_(8)                                          /* (WFT_WFCON1 Position) Wafer Test Data Out Bus Width  (See Note x - VALID in Pin Mode ONLY) */
#define WFT_WFCON1_WIDTH_Msk                  (_UINT16_(0x1) << WFT_WFCON1_WIDTH_Pos)              /* (WFT_WFCON1 Mask) WIDTH */
#define WFT_WFCON1_WIDTH(value)               (WFT_WFCON1_WIDTH_Msk & (_UINT16_(value) << WFT_WFCON1_WIDTH_Pos)) 

/* -------- WFT_WFCON2 : (WFT Offset: 0x02) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON2_RESETVALUE                 _UINT16_(0x00)                                       /*  (WFT_WFCON2) Wafer Flash Test Control Register  Reset Value */

