Microchip-MPLAB-Harmony/csp_apps_pic32cm_sg00_gc00/apps/tcc/tcc_timer_mode/firmware/src/packs/PIC32CM5112GC00100_DFP/component/wft.h
#define WFT_WFCON2_INC_VALA_Pos               _UINT16_(0)                                          /* (WFT_WFCON2) Increment value for WFADRx  WFWDATx register andUsed whenever ADR_INCA or WDAT_INCA command is executed Position */
#define WFT_WFCON2_INC_VALA_Msk               (_UINT16_(0xFFF) << WFT_WFCON2_INC_VALA_Pos)         /* (WFT_WFCON2) Increment value for WFADRx  WFWDATx register andUsed whenever ADR_INCA or WDAT_INCA command is executed Mask */
#define WFT_WFCON2_INC_VALA(value)            (WFT_WFCON2_INC_VALA_Msk & (_UINT16_(value) << WFT_WFCON2_INC_VALA_Pos)) /* Assigment of value for INC_VALA in the WFT_WFCON2 register */
#define WFT_WFCON2_Msk                        _UINT16_(0x0FFF)                                     /* (WFT_WFCON2) Register Mask  */


/* -------- WFT_WFCON3 : (WFT Offset: 0x04) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON3_RESETVALUE                 _UINT16_(0x00)                                       /*  (WFT_WFCON3) Wafer Flash Test Control Register  Reset Value */

#define WFT_WFCON3_INC_VALB_Pos               _UINT16_(0)                                          /* (WFT_WFCON3) Increment value for WFADRx,  WFWDATx register and Used whenever ADR_INCB or WDAT_INCB command is executed and is automatically used under certain conditions Position */
#define WFT_WFCON3_INC_VALB_Msk               (_UINT16_(0xFFF) << WFT_WFCON3_INC_VALB_Pos)         /* (WFT_WFCON3) Increment value for WFADRx,  WFWDATx register and Used whenever ADR_INCB or WDAT_INCB command is executed and is automatically used under certain conditions Mask */
#define WFT_WFCON3_INC_VALB(value)            (WFT_WFCON3_INC_VALB_Msk & (_UINT16_(value) << WFT_WFCON3_INC_VALB_Pos)) /* Assigment of value for INC_VALB in the WFT_WFCON3 register */
#define WFT_WFCON3_Msk                        _UINT16_(0x0FFF)                                     /* (WFT_WFCON3) Register Mask  */


/* -------- WFT_WFCON4 : (WFT Offset: 0x06) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON4_RESETVALUE                 _UINT16_(0x0F)                                       /*  (WFT_WFCON4) Wafer Flash Test Control Register  Reset Value */

#define WFT_WFCON4_WFCEB_Pos                  _UINT16_(0)                                          /* (WFT_WFCON4) Controls active low Chip Enable Signal for each panel (equivalent to TSMC XE) Position */
#define WFT_WFCON4_WFCEB_Msk                  (_UINT16_(0xF) << WFT_WFCON4_WFCEB_Pos)              /* (WFT_WFCON4) Controls active low Chip Enable Signal for each panel (equivalent to TSMC XE) Mask */
#define WFT_WFCON4_WFCEB(value)               (WFT_WFCON4_WFCEB_Msk & (_UINT16_(value) << WFT_WFCON4_WFCEB_Pos)) /* Assigment of value for WFCEB in the WFT_WFCON4 register */
#define WFT_WFCON4_PS_Pos                     _UINT16_(4)                                          /* (WFT_WFCON4) Panel Select Bits Position */
#define WFT_WFCON4_PS_Msk                     (_UINT16_(0xF) << WFT_WFCON4_PS_Pos)                 /* (WFT_WFCON4) Panel Select Bits Mask */
#define WFT_WFCON4_PS(value)                  (WFT_WFCON4_PS_Msk & (_UINT16_(value) << WFT_WFCON4_PS_Pos)) /* Assigment of value for PS in the WFT_WFCON4 register */
#define WFT_WFCON4_Msk                        _UINT16_(0x00FF)                                     /* (WFT_WFCON4) Register Mask  */


/* -------- WFT_WFCON5 : (WFT Offset: 0x08) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON5_RESETVALUE                 _UINT16_(0x80)                                       /*  (WFT_WFCON5) Wafer Flash Test Control Register  Reset Value */

#define WFT_WFCON5_WFRETRY_Pos                _UINT16_(0)                                          /* (WFT_WFCON5) Erase Retry Control Position */
#define WFT_WFCON5_WFRETRY_Msk                (_UINT16_(0x3) << WFT_WFCON5_WFRETRY_Pos)            /* (WFT_WFCON5) Erase Retry Control Mask */
#define WFT_WFCON5_WFRETRY(value)             (WFT_WFCON5_WFRETRY_Msk & (_UINT16_(value) << WFT_WFCON5_WFRETRY_Pos)) /* Assigment of value for WFRETRY in the WFT_WFCON5 register */
#define WFT_WFCON5_WFVREAD1_Pos               _UINT16_(2)                                          /* (WFT_WFCON5) Verify Read for Erased cells Position */
#define WFT_WFCON5_WFVREAD1_Msk               (_UINT16_(0x1) << WFT_WFCON5_WFVREAD1_Pos)           /* (WFT_WFCON5) Verify Read for Erased cells Mask */
#define WFT_WFCON5_WFVREAD1(value)            (WFT_WFCON5_WFVREAD1_Msk & (_UINT16_(value) << WFT_WFCON5_WFVREAD1_Pos)) /* Assigment of value for WFVREAD1 in the WFT_WFCON5 register */
#define WFT_WFCON5_WFSRHT_Pos                 _UINT16_(5)                                          /* (WFT_WFCON5) Slow Read for 150 degree C high temperature enable bit Position */
#define WFT_WFCON5_WFSRHT_Msk                 (_UINT16_(0x1) << WFT_WFCON5_WFSRHT_Pos)             /* (WFT_WFCON5) Slow Read for 150 degree C high temperature enable bit Mask */
#define WFT_WFCON5_WFSRHT(value)              (WFT_WFCON5_WFSRHT_Msk & (_UINT16_(value) << WFT_WFCON5_WFSRHT_Pos)) /* Assigment of value for WFSRHT in the WFT_WFCON5 register */
#define WFT_WFCON5_WFRDEN_Pos                 _UINT16_(6)                                          /* (WFT_WFCON5) Controls FLASH input RDEN Signal Position */
#define WFT_WFCON5_WFRDEN_Msk                 (_UINT16_(0x1) << WFT_WFCON5_WFRDEN_Pos)             /* (WFT_WFCON5) Controls FLASH input RDEN Signal Mask */
#define WFT_WFCON5_WFRDEN(value)              (WFT_WFCON5_WFRDEN_Msk & (_UINT16_(value) << WFT_WFCON5_WFRDEN_Pos)) /* Assigment of value for WFRDEN in the WFT_WFCON5 register */
#define WFT_WFCON5_RECALL_Pos                 _UINT16_(7)                                          /* (WFT_WFCON5) Wafer Test Recall Enable bit Position */
#define WFT_WFCON5_RECALL_Msk                 (_UINT16_(0x1) << WFT_WFCON5_RECALL_Pos)             /* (WFT_WFCON5) Wafer Test Recall Enable bit Mask */
#define WFT_WFCON5_RECALL(value)              (WFT_WFCON5_RECALL_Msk & (_UINT16_(value) << WFT_WFCON5_RECALL_Pos)) /* Assigment of value for RECALL in the WFT_WFCON5 register */
#define WFT_WFCON5_ADR_DAT_Pos                _UINT16_(8)                                          /* (WFT_WFCON5) Use byte address WFADRx as the word programming data WFWDAT enable bit. Position */
#define WFT_WFCON5_ADR_DAT_Msk                (_UINT16_(0x1) << WFT_WFCON5_ADR_DAT_Pos)            /* (WFT_WFCON5) Use byte address WFADRx as the word programming data WFWDAT enable bit. Mask */
#define WFT_WFCON5_ADR_DAT(value)             (WFT_WFCON5_ADR_DAT_Msk & (_UINT16_(value) << WFT_WFCON5_ADR_DAT_Pos)) /* Assigment of value for ADR_DAT in the WFT_WFCON5 register */
#define WFT_WFCON5_WFNVR_Pos                  _UINT16_(12)                                         /* (WFT_WFCON5) Controls NVR Space Select Signal (equivalent to TSMC IFREN) Position */
#define WFT_WFCON5_WFNVR_Msk                  (_UINT16_(0x1) << WFT_WFCON5_WFNVR_Pos)              /* (WFT_WFCON5) Controls NVR Space Select Signal (equivalent to TSMC IFREN) Mask */
#define WFT_WFCON5_WFNVR(value)               (WFT_WFCON5_WFNVR_Msk & (_UINT16_(value) << WFT_WFCON5_WFNVR_Pos)) /* Assigment of value for WFNVR in the WFT_WFCON5 register */
#define WFT_WFCON5_Msk                        _UINT16_(0x11E7)                                     /* (WFT_WFCON5) Register Mask  */

#define WFT_WFCON5_WFVREAD_Pos                _UINT16_(2)                                          /* (WFT_WFCON5 Position) Verify Read for Erased cells */
#define WFT_WFCON5_WFVREAD_Msk                (_UINT16_(0x1) << WFT_WFCON5_WFVREAD_Pos)            /* (WFT_WFCON5 Mask) WFVREAD */
#define WFT_WFCON5_WFVREAD(value)             (WFT_WFCON5_WFVREAD_Msk & (_UINT16_(value) << WFT_WFCON5_WFVREAD_Pos)) 

/* -------- WFT_WFCON6 : (WFT Offset: 0x0A) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON6_RESETVALUE                 _UINT16_(0x00)                                       /*  (WFT_WFCON6) Wafer Flash Test Control Register  Reset Value */

#define WFT_WFCON6_WFARRDN_Pos                _UINT16_(0)                                          /* (WFT_WFCON6) Controls Access to Redundant Array Space Signals (ARRDN[7:0]) Position */
#define WFT_WFCON6_WFARRDN_Msk                (_UINT16_(0x3) << WFT_WFCON6_WFARRDN_Pos)            /* (WFT_WFCON6) Controls Access to Redundant Array Space Signals (ARRDN[7:0]) Mask */
#define WFT_WFCON6_WFARRDN(value)             (WFT_WFCON6_WFARRDN_Msk & (_UINT16_(value) << WFT_WFCON6_WFARRDN_Pos)) /* Assigment of value for WFARRDN in the WFT_WFCON6 register */
#define WFT_WFCON6_Msk                        _UINT16_(0x0003)                                     /* (WFT_WFCON6) Register Mask  */


/* -------- WFT_WFCON7 : (WFT Offset: 0x0C) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON7_RESETVALUE                 _UINT16_(0x04)                                       /*  (WFT_WFCON7) Wafer Flash Test Control Register  Reset Value */

