Microchip-MPLAB-Harmony/csp_apps_pic32cm_sg00_gc00/apps/tcc/tcc_timer_mode/firmware/src/packs/PIC32CM5112GC00100_DFP/component/wft.h
#define WFT_WFCON7_WFCHIP_Pos                 _UINT16_(0)                                          /* (WFT_WFCON7) Controls Chip Erase Cycle Definition Signal (similar to TSMC MAS1) Position */
#define WFT_WFCON7_WFCHIP_Msk                 (_UINT16_(0x1) << WFT_WFCON7_WFCHIP_Pos)             /* (WFT_WFCON7) Controls Chip Erase Cycle Definition Signal (similar to TSMC MAS1) Mask */
#define WFT_WFCON7_WFCHIP(value)              (WFT_WFCON7_WFCHIP_Msk & (_UINT16_(value) << WFT_WFCON7_WFCHIP_Pos)) /* Assigment of value for WFCHIP in the WFT_WFCON7 register */
#define WFT_WFCON7_WFTMEN_Pos                 _UINT16_(1)                                          /* (WFT_WFCON7) Controls Flash IP Test Mode Entry and Test Code Write Position */
#define WFT_WFCON7_WFTMEN_Msk                 (_UINT16_(0x1) << WFT_WFCON7_WFTMEN_Pos)             /* (WFT_WFCON7) Controls Flash IP Test Mode Entry and Test Code Write Mask */
#define WFT_WFCON7_WFTMEN(value)              (WFT_WFCON7_WFTMEN_Msk & (_UINT16_(value) << WFT_WFCON7_WFTMEN_Pos)) /* Assigment of value for WFTMEN in the WFT_WFCON7 register */
#define WFT_WFCON7_WFWEB_Pos                  _UINT16_(2)                                          /* (WFT_WFCON7) Controls Non-volatile Store Cycle Definition Signal (similar to TSMC NVSTR) Position */
#define WFT_WFCON7_WFWEB_Msk                  (_UINT16_(0x1) << WFT_WFCON7_WFWEB_Pos)              /* (WFT_WFCON7) Controls Non-volatile Store Cycle Definition Signal (similar to TSMC NVSTR) Mask */
#define WFT_WFCON7_WFWEB(value)               (WFT_WFCON7_WFWEB_Msk & (_UINT16_(value) << WFT_WFCON7_WFWEB_Pos)) /* Assigment of value for WFWEB in the WFT_WFCON7 register */
#define WFT_WFCON7_WFPROG2_Pos                _UINT16_(3)                                          /* (WFT_WFCON7) Controls Y MUX Signal (similar to TSMC YE - only used during programming) Position */
#define WFT_WFCON7_WFPROG2_Msk                (_UINT16_(0x1) << WFT_WFCON7_WFPROG2_Pos)            /* (WFT_WFCON7) Controls Y MUX Signal (similar to TSMC YE - only used during programming) Mask */
#define WFT_WFCON7_WFPROG2(value)             (WFT_WFCON7_WFPROG2_Msk & (_UINT16_(value) << WFT_WFCON7_WFPROG2_Pos)) /* Assigment of value for WFPROG2 in the WFT_WFCON7 register */
#define WFT_WFCON7_WFERASE_Pos                _UINT16_(4)                                          /* (WFT_WFCON7) Controls Erase Cycle Definition Signal (similar to TSMC ERASE) Position */
#define WFT_WFCON7_WFERASE_Msk                (_UINT16_(0x1) << WFT_WFCON7_WFERASE_Pos)            /* (WFT_WFCON7) Controls Erase Cycle Definition Signal (similar to TSMC ERASE) Mask */
#define WFT_WFCON7_WFERASE(value)             (WFT_WFCON7_WFERASE_Msk & (_UINT16_(value) << WFT_WFCON7_WFERASE_Pos)) /* Assigment of value for WFERASE in the WFT_WFCON7 register */
#define WFT_WFCON7_WFPROG_Pos                 _UINT16_(5)                                          /* (WFT_WFCON7) Controls Program Cycle Definition Signal (similar to TSMC PROG) Position */
#define WFT_WFCON7_WFPROG_Msk                 (_UINT16_(0x1) << WFT_WFCON7_WFPROG_Pos)             /* (WFT_WFCON7) Controls Program Cycle Definition Signal (similar to TSMC PROG) Mask */
#define WFT_WFCON7_WFPROG(value)              (WFT_WFCON7_WFPROG_Msk & (_UINT16_(value) << WFT_WFCON7_WFPROG_Pos)) /* Assigment of value for WFPROG in the WFT_WFCON7 register */
#define WFT_WFCON7_WFNVR_CER_Pos              _UINT16_(6)                                          /* (WFT_WFCON7) Controls NVR Chip Erase Signal Position */
#define WFT_WFCON7_WFNVR_CER_Msk              (_UINT16_(0x1) << WFT_WFCON7_WFNVR_CER_Pos)          /* (WFT_WFCON7) Controls NVR Chip Erase Signal Mask */
#define WFT_WFCON7_WFNVR_CER(value)           (WFT_WFCON7_WFNVR_CER_Msk & (_UINT16_(value) << WFT_WFCON7_WFNVR_CER_Pos)) /* Assigment of value for WFNVR_CER in the WFT_WFCON7 register */
#define WFT_WFCON7_WFPREPG_Pos                _UINT16_(7)                                          /* (WFT_WFCON7) Pre-Program indicator Position */
#define WFT_WFCON7_WFPREPG_Msk                (_UINT16_(0x1) << WFT_WFCON7_WFPREPG_Pos)            /* (WFT_WFCON7) Pre-Program indicator Mask */
#define WFT_WFCON7_WFPREPG(value)             (WFT_WFCON7_WFPREPG_Msk & (_UINT16_(value) << WFT_WFCON7_WFPREPG_Pos)) /* Assigment of value for WFPREPG in the WFT_WFCON7 register */
#define WFT_WFCON7_Msk                        _UINT16_(0x00FF)                                     /* (WFT_WFCON7) Register Mask  */


/* -------- WFT_WFCON8 : (WFT Offset: 0x0E) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON8_RESETVALUE                 _UINT16_(0x00)                                       /*  (WFT_WFCON8) Wafer Flash Test Control Register  Reset Value */

#define WFT_WFCON8_PAGE_SZ_Pos                _UINT16_(0)                                          /* (WFT_WFCON8) Page Size Control bits - Used to determine when a Page boundary has been crossed Position */
#define WFT_WFCON8_PAGE_SZ_Msk                (_UINT16_(0xF) << WFT_WFCON8_PAGE_SZ_Pos)            /* (WFT_WFCON8) Page Size Control bits - Used to determine when a Page boundary has been crossed Mask */
#define WFT_WFCON8_PAGE_SZ(value)             (WFT_WFCON8_PAGE_SZ_Msk & (_UINT16_(value) << WFT_WFCON8_PAGE_SZ_Pos)) /* Assigment of value for PAGE_SZ in the WFT_WFCON8 register */
#define WFT_WFCON8_ROW_SZ_Pos                 _UINT16_(4)                                          /* (WFT_WFCON8) Row Size Control bits - Used to determine when a data inversion skip should occur for checkerboard patterns. Position */
#define WFT_WFCON8_ROW_SZ_Msk                 (_UINT16_(0xF) << WFT_WFCON8_ROW_SZ_Pos)             /* (WFT_WFCON8) Row Size Control bits - Used to determine when a data inversion skip should occur for checkerboard patterns. Mask */
#define WFT_WFCON8_ROW_SZ(value)              (WFT_WFCON8_ROW_SZ_Msk & (_UINT16_(value) << WFT_WFCON8_ROW_SZ_Pos)) /* Assigment of value for ROW_SZ in the WFT_WFCON8 register */
#define WFT_WFCON8_Msk                        _UINT16_(0x00FF)                                     /* (WFT_WFCON8) Register Mask  */


