Microchip-MPLAB-Harmony/csp_apps_pic32cm_sg00_gc00/apps/tcc/tcc_timer_mode/firmware/src/packs/PIC32CM5112GC00100_DFP/component/wft.h
/* -------- WFT_WFCON9 : (WFT Offset: 0x10) (R/W 16) Wafer Flash Test Control Register -------- */
#define WFT_WFCON9_RESETVALUE                 _UINT16_(0x00)                                       /*  (WFT_WFCON9) Wafer Flash Test Control Register  Reset Value */

#define WFT_WFCON9_WFLKCFG_Pos                _UINT16_(0)                                          /* (WFT_WFCON9) Lock Fuses : Used To latch configuration registers and disable fuse read circuitry. Position */
#define WFT_WFCON9_WFLKCFG_Msk                (_UINT16_(0x1) << WFT_WFCON9_WFLKCFG_Pos)            /* (WFT_WFCON9) Lock Fuses : Used To latch configuration registers and disable fuse read circuitry. Mask */
#define WFT_WFCON9_WFLKCFG(value)             (WFT_WFCON9_WFLKCFG_Msk & (_UINT16_(value) << WFT_WFCON9_WFLKCFG_Pos)) /* Assigment of value for WFLKCFG in the WFT_WFCON9 register */
#define WFT_WFCON9_WFPORB_Pos                 _UINT16_(4)                                          /* (WFT_WFCON9) Wafer Test Flash Voltage Domain Reset bit Position */
#define WFT_WFCON9_WFPORB_Msk                 (_UINT16_(0x1) << WFT_WFCON9_WFPORB_Pos)             /* (WFT_WFCON9) Wafer Test Flash Voltage Domain Reset bit Mask */
#define WFT_WFCON9_WFPORB(value)              (WFT_WFCON9_WFPORB_Msk & (_UINT16_(value) << WFT_WFCON9_WFPORB_Pos)) /* Assigment of value for WFPORB in the WFT_WFCON9 register */
#define WFT_WFCON9_WFDPD_Pos                  _UINT16_(14)                                         /* (WFT_WFCON9) Controls Flash IP Deep Power Down signal Position */
#define WFT_WFCON9_WFDPD_Msk                  (_UINT16_(0x1) << WFT_WFCON9_WFDPD_Pos)              /* (WFT_WFCON9) Controls Flash IP Deep Power Down signal Mask */
#define WFT_WFCON9_WFDPD(value)               (WFT_WFCON9_WFDPD_Msk & (_UINT16_(value) << WFT_WFCON9_WFDPD_Pos)) /* Assigment of value for WFDPD in the WFT_WFCON9 register */
#define WFT_WFCON9_Msk                        _UINT16_(0x4011)                                     /* (WFT_WFCON9) Register Mask  */


/* -------- WFT_WFSTAT1 : (WFT Offset: 0x12) (R/W 16) Wafer Flash Test Status Register -------- */
#define WFT_WFSTAT1_RESETVALUE                _UINT16_(0x00)                                       /*  (WFT_WFSTAT1) Wafer Flash Test Status Register  Reset Value */

#define WFT_WFSTAT1_Fail_status_Pos           _UINT16_(0)                                          /* (WFT_WFSTAT1) Read Mode Fail Status for flash read data comparison Position */
#define WFT_WFSTAT1_Fail_status_Msk           (_UINT16_(0xFF) << WFT_WFSTAT1_Fail_status_Pos)      /* (WFT_WFSTAT1) Read Mode Fail Status for flash read data comparison Mask */
#define WFT_WFSTAT1_Fail_status(value)        (WFT_WFSTAT1_Fail_status_Msk & (_UINT16_(value) << WFT_WFSTAT1_Fail_status_Pos)) /* Assigment of value for Fail_status in the WFT_WFSTAT1 register */
#define WFT_WFSTAT1_DOUT_RDY_Pos              _UINT16_(8)                                          /* (WFT_WFSTAT1) The Flash Panel Data Out Ready Output status Position */
#define WFT_WFSTAT1_DOUT_RDY_Msk              (_UINT16_(0x1) << WFT_WFSTAT1_DOUT_RDY_Pos)          /* (WFT_WFSTAT1) The Flash Panel Data Out Ready Output status Mask */
#define WFT_WFSTAT1_DOUT_RDY(value)           (WFT_WFSTAT1_DOUT_RDY_Msk & (_UINT16_(value) << WFT_WFSTAT1_DOUT_RDY_Pos)) /* Assigment of value for DOUT_RDY in the WFT_WFSTAT1 register */
#define WFT_WFSTAT1_FUSE_EN_Pos               _UINT16_(9)                                          /* (WFT_WFSTAT1) The flash Panel Fuse Enable Output Status. Position */
#define WFT_WFSTAT1_FUSE_EN_Msk               (_UINT16_(0x1) << WFT_WFSTAT1_FUSE_EN_Pos)           /* (WFT_WFSTAT1) The flash Panel Fuse Enable Output Status. Mask */
#define WFT_WFSTAT1_FUSE_EN(value)            (WFT_WFSTAT1_FUSE_EN_Msk & (_UINT16_(value) << WFT_WFSTAT1_FUSE_EN_Pos)) /* Assigment of value for FUSE_EN in the WFT_WFSTAT1 register */
#define WFT_WFSTAT1_RDx_DONE_Pos              _UINT16_(14)                                         /* (WFT_WFSTAT1) Current RDx_NVM command has completed Position */
#define WFT_WFSTAT1_RDx_DONE_Msk              (_UINT16_(0x1) << WFT_WFSTAT1_RDx_DONE_Pos)          /* (WFT_WFSTAT1) Current RDx_NVM command has completed Mask */
#define WFT_WFSTAT1_RDx_DONE(value)           (WFT_WFSTAT1_RDx_DONE_Msk & (_UINT16_(value) << WFT_WFSTAT1_RDx_DONE_Pos)) /* Assigment of value for RDx_DONE in the WFT_WFSTAT1 register */
#define WFT_WFSTAT1_GFAIL_Pos                 _UINT16_(15)                                         /* (WFT_WFSTAT1) Global Fail Status Position */
#define WFT_WFSTAT1_GFAIL_Msk                 (_UINT16_(0x1) << WFT_WFSTAT1_GFAIL_Pos)             /* (WFT_WFSTAT1) Global Fail Status Mask */
#define WFT_WFSTAT1_GFAIL(value)              (WFT_WFSTAT1_GFAIL_Msk & (_UINT16_(value) << WFT_WFSTAT1_GFAIL_Pos)) /* Assigment of value for GFAIL in the WFT_WFSTAT1 register */
#define WFT_WFSTAT1_Msk                       _UINT16_(0xC3FF)                                     /* (WFT_WFSTAT1) Register Mask  */


/* -------- WFT_WFPRO1 : (WFT Offset: 0x14) (R/W 16) Wafer Flash Test NVR Protect Register -------- */
#define WFT_WFPRO1_RESETVALUE                 _UINT16_(0xFFF)                                      /*  (WFT_WFPRO1) Wafer Flash Test NVR Protect Register  Reset Value */

#define WFT_WFPRO1_WFNVR_PRO_Pos              _UINT16_(0)                                          /* (WFT_WFPRO1) Controls NVR Space Write Protect Signals Position */
#define WFT_WFPRO1_WFNVR_PRO_Msk              (_UINT16_(0xFFF) << WFT_WFPRO1_WFNVR_PRO_Pos)        /* (WFT_WFPRO1) Controls NVR Space Write Protect Signals Mask */
#define WFT_WFPRO1_WFNVR_PRO(value)           (WFT_WFPRO1_WFNVR_PRO_Msk & (_UINT16_(value) << WFT_WFPRO1_WFNVR_PRO_Pos)) /* Assigment of value for WFNVR_PRO in the WFT_WFPRO1 register */
#define WFT_WFPRO1_Msk                        _UINT16_(0x0FFF)                                     /* (WFT_WFPRO1) Register Mask  */


/* -------- WFT_WFLAS1 : (WFT Offset: 0x18) (R/W 16) Wafer Flash Test Logical Address Scramble Register -------- */
#define WFT_WFLAS1_RESETVALUE                 _UINT16_(0x3210)                                     /*  (WFT_WFLAS1) Wafer Flash Test Logical Address Scramble Register  Reset Value */

#define WFT_WFLAS1_Y0_LAS_Pos                 _UINT16_(0)                                          /* (WFT_WFLAS1) Y0 Address  Logical Address Scramble - Logical to Physical Remap Position */
#define WFT_WFLAS1_Y0_LAS_Msk                 (_UINT16_(0x7) << WFT_WFLAS1_Y0_LAS_Pos)             /* (WFT_WFLAS1) Y0 Address  Logical Address Scramble - Logical to Physical Remap Mask */
#define WFT_WFLAS1_Y0_LAS(value)              (WFT_WFLAS1_Y0_LAS_Msk & (_UINT16_(value) << WFT_WFLAS1_Y0_LAS_Pos)) /* Assigment of value for Y0_LAS in the WFT_WFLAS1 register */
#define WFT_WFLAS1_Y1_LAS_Pos                 _UINT16_(4)                                          /* (WFT_WFLAS1) Y1 Address  Logical Address Scramble - Logical to Physical Remap Position */
#define WFT_WFLAS1_Y1_LAS_Msk                 (_UINT16_(0x7) << WFT_WFLAS1_Y1_LAS_Pos)             /* (WFT_WFLAS1) Y1 Address  Logical Address Scramble - Logical to Physical Remap Mask */
#define WFT_WFLAS1_Y1_LAS(value)              (WFT_WFLAS1_Y1_LAS_Msk & (_UINT16_(value) << WFT_WFLAS1_Y1_LAS_Pos)) /* Assigment of value for Y1_LAS in the WFT_WFLAS1 register */
#define WFT_WFLAS1_Y2_LAS_Pos                 _UINT16_(8)                                          /* (WFT_WFLAS1) Y2 Address  Logical Address Scramble - Logical to Physical Remap Position */
#define WFT_WFLAS1_Y2_LAS_Msk                 (_UINT16_(0x7) << WFT_WFLAS1_Y2_LAS_Pos)             /* (WFT_WFLAS1) Y2 Address  Logical Address Scramble - Logical to Physical Remap Mask */
#define WFT_WFLAS1_Y2_LAS(value)              (WFT_WFLAS1_Y2_LAS_Msk & (_UINT16_(value) << WFT_WFLAS1_Y2_LAS_Pos)) /* Assigment of value for Y2_LAS in the WFT_WFLAS1 register */
#define WFT_WFLAS1_Y3_LAS_Pos                 _UINT16_(12)                                         /* (WFT_WFLAS1) Y3 Address  Logical Address Scramble - Logical to Physical Remap Position */
#define WFT_WFLAS1_Y3_LAS_Msk                 (_UINT16_(0x7) << WFT_WFLAS1_Y3_LAS_Pos)             /* (WFT_WFLAS1) Y3 Address  Logical Address Scramble - Logical to Physical Remap Mask */
#define WFT_WFLAS1_Y3_LAS(value)              (WFT_WFLAS1_Y3_LAS_Msk & (_UINT16_(value) << WFT_WFLAS1_Y3_LAS_Pos)) /* Assigment of value for Y3_LAS in the WFT_WFLAS1 register */
#define WFT_WFLAS1_Msk                        _UINT16_(0x7777)                                     /* (WFT_WFLAS1) Register Mask  */


/* -------- WFT_WFLAS2 : (WFT Offset: 0x1A) (R/W 16) Wafer Flash Test Logical Address Scramble Register -------- */
#define WFT_WFLAS2_RESETVALUE                 _UINT16_(0x7654)                                     /*  (WFT_WFLAS2) Wafer Flash Test Logical Address Scramble Register  Reset Value */

#define WFT_WFLAS2_Y4_LAS_Pos                 _UINT16_(0)                                          /* (WFT_WFLAS2) Y4 Address  Logical Address Scramble - Logical to Physical Remap Position */
#define WFT_WFLAS2_Y4_LAS_Msk                 (_UINT16_(0x7) << WFT_WFLAS2_Y4_LAS_Pos)             /* (WFT_WFLAS2) Y4 Address  Logical Address Scramble - Logical to Physical Remap Mask */
#define WFT_WFLAS2_Y4_LAS(value)              (WFT_WFLAS2_Y4_LAS_Msk & (_UINT16_(value) << WFT_WFLAS2_Y4_LAS_Pos)) /* Assigment of value for Y4_LAS in the WFT_WFLAS2 register */
#define WFT_WFLAS2_Y5_LAS_Pos                 _UINT16_(4)                                          /* (WFT_WFLAS2) Y5 Address  Logical Address Scramble - Logical to Physical Remap Position */
#define WFT_WFLAS2_Y5_LAS_Msk                 (_UINT16_(0x7) << WFT_WFLAS2_Y5_LAS_Pos)             /* (WFT_WFLAS2) Y5 Address  Logical Address Scramble - Logical to Physical Remap Mask */
#define WFT_WFLAS2_Y5_LAS(value)              (WFT_WFLAS2_Y5_LAS_Msk & (_UINT16_(value) << WFT_WFLAS2_Y5_LAS_Pos)) /* Assigment of value for Y5_LAS in the WFT_WFLAS2 register */
#define WFT_WFLAS2_Y6_LAS_Pos                 _UINT16_(8)                                          /* (WFT_WFLAS2) Y6 Address  Logical Address Scramble - Logical to Physical Remap Position */
#define WFT_WFLAS2_Y6_LAS_Msk                 (_UINT16_(0x7) << WFT_WFLAS2_Y6_LAS_Pos)             /* (WFT_WFLAS2) Y6 Address  Logical Address Scramble - Logical to Physical Remap Mask */
#define WFT_WFLAS2_Y6_LAS(value)              (WFT_WFLAS2_Y6_LAS_Msk & (_UINT16_(value) << WFT_WFLAS2_Y6_LAS_Pos)) /* Assigment of value for Y6_LAS in the WFT_WFLAS2 register */
#define WFT_WFLAS2_Y7_LAS_Pos                 _UINT16_(12)                                         /* (WFT_WFLAS2) Y7 Address  Logical Address Scramble - Logical to Physical Remap Position */
#define WFT_WFLAS2_Y7_LAS_Msk                 (_UINT16_(0x7) << WFT_WFLAS2_Y7_LAS_Pos)             /* (WFT_WFLAS2) Y7 Address  Logical Address Scramble - Logical to Physical Remap Mask */
#define WFT_WFLAS2_Y7_LAS(value)              (WFT_WFLAS2_Y7_LAS_Msk & (_UINT16_(value) << WFT_WFLAS2_Y7_LAS_Pos)) /* Assigment of value for Y7_LAS in the WFT_WFLAS2 register */
#define WFT_WFLAS2_Msk                        _UINT16_(0x7777)                                     /* (WFT_WFLAS2) Register Mask  */


/* -------- WFT_WFADDR : (WFT Offset: 0x1C) (R/W 32) Wafer Flash Test Address Register -------- */
#define WFT_WFADDR_RESETVALUE                 _UINT32_(0x00)                                       /*  (WFT_WFADDR) Wafer Flash Test Address Register  Reset Value */

