Microchip-MPLAB-Harmony/csp_apps_pic32cm_sg00_gc00/apps/tcc/tcc_timer_mode/firmware/src/packs/PIC32CM5112GC00100_DFP/component/wft.h
#define WFT_WFADDR_WFADR_Pos                  _UINT32_(2)                                          /* (WFT_WFADDR) Flash Panel Address Position */
#define WFT_WFADDR_WFADR_Msk                  (_UINT32_(0x3FFFFF) << WFT_WFADDR_WFADR_Pos)         /* (WFT_WFADDR) Flash Panel Address Mask */
#define WFT_WFADDR_WFADR(value)               (WFT_WFADDR_WFADR_Msk & (_UINT32_(value) << WFT_WFADDR_WFADR_Pos)) /* Assigment of value for WFADR in the WFT_WFADDR register */
#define WFT_WFADDR_Msk                        _UINT32_(0x00FFFFFC)                                 /* (WFT_WFADDR) Register Mask  */


/* -------- WFT_WFWDAT : (WFT Offset: 0x22) (R/W 16) Wafer Flash Test Write DATA Register -------- */
#define WFT_WFWDAT_RESETVALUE                 _UINT16_(0x00)                                       /*  (WFT_WFWDAT) Wafer Flash Test Write DATA Register  Reset Value */

#define WFT_WFWDAT_WDAT_Pos                   _UINT16_(0)                                          /* (WFT_WFWDAT) Wafer Level Test Programming Data Position */
#define WFT_WFWDAT_WDAT_Msk                   (_UINT16_(0xFFFF) << WFT_WFWDAT_WDAT_Pos)            /* (WFT_WFWDAT) Wafer Level Test Programming Data Mask */
#define WFT_WFWDAT_WDAT(value)                (WFT_WFWDAT_WDAT_Msk & (_UINT16_(value) << WFT_WFWDAT_WDAT_Pos)) /* Assigment of value for WDAT in the WFT_WFWDAT register */
#define WFT_WFWDAT_Msk                        _UINT16_(0xFFFF)                                     /* (WFT_WFWDAT) Register Mask  */


/* -------- WFT_WFGPS : (WFT Offset: 0x2C) ( R/ 8) General Purpose Output -------- */
#define WFT_WFGPS_RESETVALUE                  _UINT8_(0x00)                                        /*  (WFT_WFGPS) General Purpose Output  Reset Value */

#define WFT_WFGPS_GPS_Pos                     _UINT8_(0)                                           /* (WFT_WFGPS) General Purpose Status Position */
#define WFT_WFGPS_GPS_Msk                     (_UINT8_(0xFF) << WFT_WFGPS_GPS_Pos)                 /* (WFT_WFGPS) General Purpose Status Mask */
#define WFT_WFGPS_GPS(value)                  (WFT_WFGPS_GPS_Msk & (_UINT8_(value) << WFT_WFGPS_GPS_Pos)) /* Assigment of value for GPS in the WFT_WFGPS register */
#define WFT_WFGPS_Msk                         _UINT8_(0xFF)                                        /* (WFT_WFGPS) Register Mask  */


/* -------- WFT_WFGPC : (WFT Offset: 0x2E) (R/W 8) General Purpose Output -------- */
#define WFT_WFGPC_RESETVALUE                  _UINT8_(0x00)                                        /*  (WFT_WFGPC) General Purpose Output  Reset Value */

#define WFT_WFGPC_GPC_Pos                     _UINT8_(0)                                           /* (WFT_WFGPC) General Purpose Output Position */
#define WFT_WFGPC_GPC_Msk                     (_UINT8_(0xFF) << WFT_WFGPC_GPC_Pos)                 /* (WFT_WFGPC) General Purpose Output Mask */
#define WFT_WFGPC_GPC(value)                  (WFT_WFGPC_GPC_Msk & (_UINT8_(value) << WFT_WFGPC_GPC_Pos)) /* Assigment of value for GPC in the WFT_WFGPC register */
#define WFT_WFGPC_Msk                         _UINT8_(0xFF)                                        /* (WFT_WFGPC) Register Mask  */


/* -------- WFT_WFRDAT : (WFT Offset: 0x30) (R/W 16) Wafer Test Read DATA Register -------- */
#define WFT_WFRDAT_RESETVALUE                 _UINT16_(0x00)                                       /*  (WFT_WFRDAT) Wafer Test Read DATA Register  Reset Value */

#define WFT_WFRDAT_RDAT_Pos                   _UINT16_(0)                                          /* (WFT_WFRDAT) Wafer Level Test Read Data from Flash Reads Position */
#define WFT_WFRDAT_RDAT_Msk                   (_UINT16_(0xFFFF) << WFT_WFRDAT_RDAT_Pos)            /* (WFT_WFRDAT) Wafer Level Test Read Data from Flash Reads Mask */
#define WFT_WFRDAT_RDAT(value)                (WFT_WFRDAT_RDAT_Msk & (_UINT16_(value) << WFT_WFRDAT_RDAT_Pos)) /* Assigment of value for RDAT in the WFT_WFRDAT register */
#define WFT_WFRDAT_Msk                        _UINT16_(0xFFFF)                                     /* (WFT_WFRDAT) Register Mask  */


/* -------- WFT_WFRCNT : (WFT Offset: 0x54) (R/W 32) Wafer Flash Test Read Count Register -------- */
#define WFT_WFRCNT_RESETVALUE                 _UINT32_(0x00)                                       /*  (WFT_WFRCNT) Wafer Flash Test Read Count Register  Reset Value */

#define WFT_WFRCNT_WFRCNT_Pos                 _UINT32_(0)                                          /* (WFT_WFRCNT) Read Count Value - Used by the RDN_NVM Command Position */
#define WFT_WFRCNT_WFRCNT_Msk                 (_UINT32_(0xFFFFFF) << WFT_WFRCNT_WFRCNT_Pos)        /* (WFT_WFRCNT) Read Count Value - Used by the RDN_NVM Command Mask */
#define WFT_WFRCNT_WFRCNT(value)              (WFT_WFRCNT_WFRCNT_Msk & (_UINT32_(value) << WFT_WFRCNT_WFRCNT_Pos)) /* Assigment of value for WFRCNT in the WFT_WFRCNT register */
#define WFT_WFRCNT_Msk                        _UINT32_(0x00FFFFFF)                                 /* (WFT_WFRCNT) Register Mask  */


/* -------- WFT_WFRERR : (WFT Offset: 0x58) (R/W 32) Wafer Flash Test Read ERROR Count Register -------- */
#define WFT_WFRERR_RESETVALUE                 _UINT32_(0x00)                                       /*  (WFT_WFRERR) Wafer Flash Test Read ERROR Count Register  Reset Value */

#define WFT_WFRERR_WFRERR_Pos                 _UINT32_(0)                                          /* (WFT_WFRERR) Read Error Count Value - Used by the RDN_NVM Command Position */
#define WFT_WFRERR_WFRERR_Msk                 (_UINT32_(0xFFFFFFFF) << WFT_WFRERR_WFRERR_Pos)      /* (WFT_WFRERR) Read Error Count Value - Used by the RDN_NVM Command Mask */
#define WFT_WFRERR_WFRERR(value)              (WFT_WFRERR_WFRERR_Msk & (_UINT32_(value) << WFT_WFRERR_WFRERR_Pos)) /* Assigment of value for WFRERR in the WFT_WFRERR register */
#define WFT_WFRERR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (WFT_WFRERR) Register Mask  */


/* -------- WFT_WFDOUTPIN : (WFT Offset: 0x5C) ( R/ 16) Wafer Flash Test Read DOUT PINS Register -------- */
#define WFT_WFDOUTPIN_RESETVALUE              _UINT16_(0x00)                                       /*  (WFT_WFDOUTPIN) Wafer Flash Test Read DOUT PINS Register  Reset Value */

#define WFT_WFDOUTPIN_P1_DOUT_PIN_Pos         _UINT16_(0)                                          /* (WFT_WFDOUTPIN) This register bit reflects the DOUT[x] Value of flash panel 1  where x=  READ_CAL_DOUT_BIT PARAMETER Position */
#define WFT_WFDOUTPIN_P1_DOUT_PIN_Msk         (_UINT16_(0x1) << WFT_WFDOUTPIN_P1_DOUT_PIN_Pos)     /* (WFT_WFDOUTPIN) This register bit reflects the DOUT[x] Value of flash panel 1  where x=  READ_CAL_DOUT_BIT PARAMETER Mask */
#define WFT_WFDOUTPIN_P1_DOUT_PIN(value)      (WFT_WFDOUTPIN_P1_DOUT_PIN_Msk & (_UINT16_(value) << WFT_WFDOUTPIN_P1_DOUT_PIN_Pos)) /* Assigment of value for P1_DOUT_PIN in the WFT_WFDOUTPIN register */
#define WFT_WFDOUTPIN_P2_DOUT_PIN_Pos         _UINT16_(2)                                          /* (WFT_WFDOUTPIN) This register bit reflects the DOUT[x] Value of flash panel 2 where x=  READ_CAL_DOUT_BIT PARAMETER Position */
#define WFT_WFDOUTPIN_P2_DOUT_PIN_Msk         (_UINT16_(0x1) << WFT_WFDOUTPIN_P2_DOUT_PIN_Pos)     /* (WFT_WFDOUTPIN) This register bit reflects the DOUT[x] Value of flash panel 2 where x=  READ_CAL_DOUT_BIT PARAMETER Mask */
#define WFT_WFDOUTPIN_P2_DOUT_PIN(value)      (WFT_WFDOUTPIN_P2_DOUT_PIN_Msk & (_UINT16_(value) << WFT_WFDOUTPIN_P2_DOUT_PIN_Pos)) /* Assigment of value for P2_DOUT_PIN in the WFT_WFDOUTPIN register */
#define WFT_WFDOUTPIN_P3_DOUT_PIN_Pos         _UINT16_(4)                                          /* (WFT_WFDOUTPIN) This register bit reflects the DOUT[x] Value of flash panel 3 where x=  READ_CAL_DOUT_BIT PARAMETER Position */
#define WFT_WFDOUTPIN_P3_DOUT_PIN_Msk         (_UINT16_(0x1) << WFT_WFDOUTPIN_P3_DOUT_PIN_Pos)     /* (WFT_WFDOUTPIN) This register bit reflects the DOUT[x] Value of flash panel 3 where x=  READ_CAL_DOUT_BIT PARAMETER Mask */
#define WFT_WFDOUTPIN_P3_DOUT_PIN(value)      (WFT_WFDOUTPIN_P3_DOUT_PIN_Msk & (_UINT16_(value) << WFT_WFDOUTPIN_P3_DOUT_PIN_Pos)) /* Assigment of value for P3_DOUT_PIN in the WFT_WFDOUTPIN register */
#define WFT_WFDOUTPIN_P4_DOUT_PIN_Pos         _UINT16_(6)                                          /* (WFT_WFDOUTPIN) This register bit reflects the DOUT[x] Value of flash panel 4 where x=  READ_CAL_DOUT_BIT PARAMETER Position */
#define WFT_WFDOUTPIN_P4_DOUT_PIN_Msk         (_UINT16_(0x1) << WFT_WFDOUTPIN_P4_DOUT_PIN_Pos)     /* (WFT_WFDOUTPIN) This register bit reflects the DOUT[x] Value of flash panel 4 where x=  READ_CAL_DOUT_BIT PARAMETER Mask */
#define WFT_WFDOUTPIN_P4_DOUT_PIN(value)      (WFT_WFDOUTPIN_P4_DOUT_PIN_Msk & (_UINT16_(value) << WFT_WFDOUTPIN_P4_DOUT_PIN_Pos)) /* Assigment of value for P4_DOUT_PIN in the WFT_WFDOUTPIN register */
#define WFT_WFDOUTPIN_Msk                     _UINT16_(0x0055)                                     /* (WFT_WFDOUTPIN) Register Mask  */


