Microchip-MPLAB-Harmony/csp_apps_pic32cm_sg00_gc00/apps/tcc/tcc_timer_mode/firmware/src/packs/PIC32CM5112GC00100_DFP/component/wft.h
/* -------- WFT_RD1_NVM : (WFT Offset: 0x70) (R/W 8) Command RD1_NVM -------- */
#define WFT_RD1_NVM_RESETVALUE                _UINT8_(0x00)                                        /*  (WFT_RD1_NVM) Command RD1_NVM  Reset Value */

#define WFT_RD1_NVM_Msk                       _UINT8_(0x00)                                        /* (WFT_RD1_NVM) Register Mask  */


/* -------- WFT_RDN_NVM : (WFT Offset: 0x71) (R/W 8) Command RDN_NVM -------- */
#define WFT_RDN_NVM_RESETVALUE                _UINT8_(0x00)                                        /*  (WFT_RDN_NVM) Command RDN_NVM  Reset Value */

#define WFT_RDN_NVM_Msk                       _UINT8_(0x00)                                        /* (WFT_RDN_NVM) Register Mask  */


/* -------- WFT_ADR_INCA : (WFT Offset: 0x72) (R/W 8) Command ADR_INCA -------- */
#define WFT_ADR_INCA_RESETVALUE               _UINT8_(0x00)                                        /*  (WFT_ADR_INCA) Command ADR_INCA  Reset Value */

#define WFT_ADR_INCA_Msk                      _UINT8_(0x00)                                        /* (WFT_ADR_INCA) Register Mask  */


/* -------- WFT_ADR_INCB : (WFT Offset: 0x73) (R/W 8) Command ADR_INCB -------- */
#define WFT_ADR_INCB_RESETVALUE               _UINT8_(0x00)                                        /*  (WFT_ADR_INCB) Command ADR_INCB  Reset Value */

#define WFT_ADR_INCB_Msk                      _UINT8_(0x00)                                        /* (WFT_ADR_INCB) Register Mask  */


/* -------- WFT_WDAT_INV : (WFT Offset: 0x74) (R/W 8) Command WDAT_INV -------- */
#define WFT_WDAT_INV_RESETVALUE               _UINT8_(0x00)                                        /*  (WFT_WDAT_INV) Command WDAT_INV  Reset Value */

#define WFT_WDAT_INV_Msk                      _UINT8_(0x00)                                        /* (WFT_WDAT_INV) Register Mask  */


/* -------- WFT_RDAT_INV : (WFT Offset: 0x75) (R/W 8) Command RDAT_INV -------- */
#define WFT_RDAT_INV_RESETVALUE               _UINT8_(0x00)                                        /*  (WFT_RDAT_INV) Command RDAT_INV  Reset Value */

#define WFT_RDAT_INV_Msk                      _UINT8_(0x00)                                        /* (WFT_RDAT_INV) Register Mask  */


/* -------- WFT_RST_SFR : (WFT Offset: 0x76) (R/W 8) Command RST_SFR -------- */
#define WFT_RST_SFR_RESETVALUE                _UINT8_(0x00)                                        /*  (WFT_RST_SFR) Command RST_SFR  Reset Value */

#define WFT_RST_SFR_Msk                       _UINT8_(0x00)                                        /* (WFT_RST_SFR) Register Mask  */


/* -------- WFT_CPY_ADR : (WFT Offset: 0x77) (R/W 8) Command CPY_ADR -------- */
#define WFT_CPY_ADR_RESETVALUE                _UINT8_(0x00)                                        /*  (WFT_CPY_ADR) Command CPY_ADR  Reset Value */

#define WFT_CPY_ADR_Msk                       _UINT8_(0x00)                                        /* (WFT_CPY_ADR) Register Mask  */


/* -------- WFT_WDAT_INCA : (WFT Offset: 0x78) (R/W 8) Command WDAT_INCA -------- */
#define WFT_WDAT_INCA_RESETVALUE              _UINT8_(0x00)                                        /*  (WFT_WDAT_INCA) Command WDAT_INCA  Reset Value */

#define WFT_WDAT_INCA_Msk                     _UINT8_(0x00)                                        /* (WFT_WDAT_INCA) Register Mask  */


/* -------- WFT_WDAT_INCB : (WFT Offset: 0x79) (R/W 8) Command WDAT_INCB -------- */
#define WFT_WDAT_INCB_RESETVALUE              _UINT8_(0x00)                                        /*  (WFT_WDAT_INCB) Command WDAT_INCB  Reset Value */

#define WFT_WDAT_INCB_Msk                     _UINT8_(0x00)                                        /* (WFT_WDAT_INCB) Register Mask  */


/* -------- WFT_DAT_SET : (WFT Offset: 0x7A) (R/W 8) Command DAT_SET -------- */
#define WFT_DAT_SET_RESETVALUE                _UINT8_(0x00)                                        /*  (WFT_DAT_SET) Command DAT_SET  Reset Value */

#define WFT_DAT_SET_Msk                       _UINT8_(0x00)                                        /* (WFT_DAT_SET) Register Mask  */


/* -------- WFT_DAT_CLR : (WFT Offset: 0x7B) (R/W 8) Command DAT_CLR -------- */
#define WFT_DAT_CLR_RESETVALUE                _UINT8_(0x00)                                        /*  (WFT_DAT_CLR) Command DAT_CLR  Reset Value */

#define WFT_DAT_CLR_Msk                       _UINT8_(0x00)                                        /* (WFT_DAT_CLR) Register Mask  */


/* -------- WFT_WNOP : (WFT Offset: 0x7C) (R/W 8) Command WNOP -------- */
#define WFT_WNOP_RESETVALUE                   _UINT8_(0x00)                                        /*  (WFT_WNOP) Command WNOP  Reset Value */

#define WFT_WNOP_Msk                          _UINT8_(0x00)                                        /* (WFT_WNOP) Register Mask  */


/* -------- WFT_EXT_CMD : (WFT Offset: 0x7F) (R/W 8) Command EXT_CMD -------- */
#define WFT_EXT_CMD_RESETVALUE                _UINT8_(0x00)                                        /*  (WFT_EXT_CMD) Command EXT_CMD  Reset Value */

#define WFT_EXT_CMD_Msk                       _UINT8_(0x00)                                        /* (WFT_EXT_CMD) Register Mask  */


/** \brief WFT register offsets definitions */
#define WFT_WFCON1_REG_OFST            _UINT32_(0x00)      /* (WFT_WFCON1) Wafer Flash Test Control Register Offset */
#define WFT_WFCON2_REG_OFST            _UINT32_(0x02)      /* (WFT_WFCON2) Wafer Flash Test Control Register Offset */
#define WFT_WFCON3_REG_OFST            _UINT32_(0x04)      /* (WFT_WFCON3) Wafer Flash Test Control Register Offset */
#define WFT_WFCON4_REG_OFST            _UINT32_(0x06)      /* (WFT_WFCON4) Wafer Flash Test Control Register Offset */
#define WFT_WFCON5_REG_OFST            _UINT32_(0x08)      /* (WFT_WFCON5) Wafer Flash Test Control Register Offset */
#define WFT_WFCON6_REG_OFST            _UINT32_(0x0A)      /* (WFT_WFCON6) Wafer Flash Test Control Register Offset */
#define WFT_WFCON7_REG_OFST            _UINT32_(0x0C)      /* (WFT_WFCON7) Wafer Flash Test Control Register Offset */
#define WFT_WFCON8_REG_OFST            _UINT32_(0x0E)      /* (WFT_WFCON8) Wafer Flash Test Control Register Offset */
#define WFT_WFCON9_REG_OFST            _UINT32_(0x10)      /* (WFT_WFCON9) Wafer Flash Test Control Register Offset */
#define WFT_WFSTAT1_REG_OFST           _UINT32_(0x12)      /* (WFT_WFSTAT1) Wafer Flash Test Status Register Offset */
#define WFT_WFPRO1_REG_OFST            _UINT32_(0x14)      /* (WFT_WFPRO1) Wafer Flash Test NVR Protect Register Offset */
#define WFT_WFLAS1_REG_OFST            _UINT32_(0x18)      /* (WFT_WFLAS1) Wafer Flash Test Logical Address Scramble Register Offset */
#define WFT_WFLAS2_REG_OFST            _UINT32_(0x1A)      /* (WFT_WFLAS2) Wafer Flash Test Logical Address Scramble Register Offset */
#define WFT_WFADDR_REG_OFST            _UINT32_(0x1C)      /* (WFT_WFADDR) Wafer Flash Test Address Register Offset */
#define WFT_WFWDAT_REG_OFST            _UINT32_(0x22)      /* (WFT_WFWDAT) Wafer Flash Test Write DATA Register Offset */
#define WFT_WFWDAT0_REG_OFST           _UINT32_(0x22)      /* (WFT_WFWDAT0) Wafer Flash Test Write DATA Register Offset */
#define WFT_WFWDAT1_REG_OFST           _UINT32_(0x24)      /* (WFT_WFWDAT1) Wafer Flash Test Write DATA Register Offset */
#define WFT_WFWDAT2_REG_OFST           _UINT32_(0x26)      /* (WFT_WFWDAT2) Wafer Flash Test Write DATA Register Offset */
#define WFT_WFGPS_REG_OFST             _UINT32_(0x2C)      /* (WFT_WFGPS) General Purpose Output Offset */
#define WFT_WFGPC_REG_OFST             _UINT32_(0x2E)      /* (WFT_WFGPC) General Purpose Output Offset */
#define WFT_WFRDAT_REG_OFST            _UINT32_(0x30)      /* (WFT_WFRDAT) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT0_REG_OFST           _UINT32_(0x30)      /* (WFT_WFRDAT0) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT1_REG_OFST           _UINT32_(0x32)      /* (WFT_WFRDAT1) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT2_REG_OFST           _UINT32_(0x34)      /* (WFT_WFRDAT2) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT3_REG_OFST           _UINT32_(0x36)      /* (WFT_WFRDAT3) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT4_REG_OFST           _UINT32_(0x38)      /* (WFT_WFRDAT4) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT5_REG_OFST           _UINT32_(0x3A)      /* (WFT_WFRDAT5) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT6_REG_OFST           _UINT32_(0x3C)      /* (WFT_WFRDAT6) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT7_REG_OFST           _UINT32_(0x3E)      /* (WFT_WFRDAT7) Wafer Test Read DATA Register Offset */
#define WFT_WFRDAT8_REG_OFST           _UINT32_(0x40)      /* (WFT_WFRDAT8) Wafer Test Read DATA Register Offset */
#define WFT_WFRCNT_REG_OFST            _UINT32_(0x54)      /* (WFT_WFRCNT) Wafer Flash Test Read Count Register Offset */
#define WFT_WFRERR_REG_OFST            _UINT32_(0x58)      /* (WFT_WFRERR) Wafer Flash Test Read ERROR Count Register Offset */
#define WFT_WFDOUTPIN_REG_OFST         _UINT32_(0x5C)      /* (WFT_WFDOUTPIN) Wafer Flash Test Read DOUT PINS Register Offset */
#define WFT_RD1_NVM_REG_OFST           _UINT32_(0x70)      /* (WFT_RD1_NVM) Command RD1_NVM Offset */
#define WFT_RDN_NVM_REG_OFST           _UINT32_(0x71)      /* (WFT_RDN_NVM) Command RDN_NVM Offset */
#define WFT_ADR_INCA_REG_OFST          _UINT32_(0x72)      /* (WFT_ADR_INCA) Command ADR_INCA Offset */
#define WFT_ADR_INCB_REG_OFST          _UINT32_(0x73)      /* (WFT_ADR_INCB) Command ADR_INCB Offset */
#define WFT_WDAT_INV_REG_OFST          _UINT32_(0x74)      /* (WFT_WDAT_INV) Command WDAT_INV Offset */
#define WFT_RDAT_INV_REG_OFST          _UINT32_(0x75)      /* (WFT_RDAT_INV) Command RDAT_INV Offset */
#define WFT_RST_SFR_REG_OFST           _UINT32_(0x76)      /* (WFT_RST_SFR) Command RST_SFR Offset */
#define WFT_CPY_ADR_REG_OFST           _UINT32_(0x77)      /* (WFT_CPY_ADR) Command CPY_ADR Offset */
#define WFT_WDAT_INCA_REG_OFST         _UINT32_(0x78)      /* (WFT_WDAT_INCA) Command WDAT_INCA Offset */
#define WFT_WDAT_INCB_REG_OFST         _UINT32_(0x79)      /* (WFT_WDAT_INCB) Command WDAT_INCB Offset */
#define WFT_DAT_SET_REG_OFST           _UINT32_(0x7A)      /* (WFT_DAT_SET) Command DAT_SET Offset */
#define WFT_DAT_CLR_REG_OFST           _UINT32_(0x7B)      /* (WFT_DAT_CLR) Command DAT_CLR Offset */
#define WFT_WNOP_REG_OFST              _UINT32_(0x7C)      /* (WFT_WNOP) Command WNOP Offset */
#define WFT_EXT_CMD_REG_OFST           _UINT32_(0x7F)      /* (WFT_EXT_CMD) Command EXT_CMD Offset */

