Microchip-MPLAB-Harmony/csp_apps_pic32cm_sg00_gc00/apps/tcc/tcc_timer_mode/firmware/src/packs/PIC32CM5112GC00100_DFP/component/wft.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief WFT register API structure */
typedef struct
{  /* MCU32 Flash Wafer Test Controller */
  __IO  uint16_t                       WFT_WFCON1;         /**< Offset: 0x00 (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFCON2;         /**< Offset: 0x02 (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFCON3;         /**< Offset: 0x04 (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFCON4;         /**< Offset: 0x06 (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFCON5;         /**< Offset: 0x08 (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFCON6;         /**< Offset: 0x0A (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFCON7;         /**< Offset: 0x0C (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFCON8;         /**< Offset: 0x0E (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFCON9;         /**< Offset: 0x10 (R/W  16) Wafer Flash Test Control Register */
  __IO  uint16_t                       WFT_WFSTAT1;        /**< Offset: 0x12 (R/W  16) Wafer Flash Test Status Register */
  __IO  uint16_t                       WFT_WFPRO1;         /**< Offset: 0x14 (R/W  16) Wafer Flash Test NVR Protect Register */
  __I   uint8_t                        Reserved1[0x02];
  __IO  uint16_t                       WFT_WFLAS1;         /**< Offset: 0x18 (R/W  16) Wafer Flash Test Logical Address Scramble Register */
  __IO  uint16_t                       WFT_WFLAS2;         /**< Offset: 0x1A (R/W  16) Wafer Flash Test Logical Address Scramble Register */
  __IO  uint32_t                       WFT_WFADDR;         /**< Offset: 0x1C (R/W  32) Wafer Flash Test Address Register */
  __I   uint8_t                        Reserved2[0x02];
  __IO  uint16_t                       WFT_WFWDAT[3];      /**< Offset: 0x22 (R/W  16) Wafer Flash Test Write DATA Register */
  __I   uint8_t                        Reserved3[0x04];
  __I   uint8_t                        WFT_WFGPS;          /**< Offset: 0x2C (R/   8) General Purpose Output */
  __I   uint8_t                        Reserved4[0x01];
  __IO  uint8_t                        WFT_WFGPC;          /**< Offset: 0x2E (R/W  8) General Purpose Output */
  __I   uint8_t                        Reserved5[0x01];
  __IO  uint16_t                       WFT_WFRDAT[9];      /**< Offset: 0x30 (R/W  16) Wafer Test Read DATA Register */
  __I   uint8_t                        Reserved6[0x12];
  __IO  uint32_t                       WFT_WFRCNT;         /**< Offset: 0x54 (R/W  32) Wafer Flash Test Read Count Register */
  __IO  uint32_t                       WFT_WFRERR;         /**< Offset: 0x58 (R/W  32) Wafer Flash Test Read ERROR Count Register */
  __I   uint16_t                       WFT_WFDOUTPIN;      /**< Offset: 0x5C (R/   16) Wafer Flash Test Read DOUT PINS Register */
  __I   uint8_t                        Reserved7[0x12];
  __IO  uint8_t                        WFT_RD1_NVM;        /**< Offset: 0x70 (R/W  8) Command RD1_NVM */
  __IO  uint8_t                        WFT_RDN_NVM;        /**< Offset: 0x71 (R/W  8) Command RDN_NVM */
  __IO  uint8_t                        WFT_ADR_INCA;       /**< Offset: 0x72 (R/W  8) Command ADR_INCA */
  __IO  uint8_t                        WFT_ADR_INCB;       /**< Offset: 0x73 (R/W  8) Command ADR_INCB */
  __IO  uint8_t                        WFT_WDAT_INV;       /**< Offset: 0x74 (R/W  8) Command WDAT_INV */
  __IO  uint8_t                        WFT_RDAT_INV;       /**< Offset: 0x75 (R/W  8) Command RDAT_INV */
  __IO  uint8_t                        WFT_RST_SFR;        /**< Offset: 0x76 (R/W  8) Command RST_SFR */
  __IO  uint8_t                        WFT_CPY_ADR;        /**< Offset: 0x77 (R/W  8) Command CPY_ADR */
  __IO  uint8_t                        WFT_WDAT_INCA;      /**< Offset: 0x78 (R/W  8) Command WDAT_INCA */
  __IO  uint8_t                        WFT_WDAT_INCB;      /**< Offset: 0x79 (R/W  8) Command WDAT_INCB */
  __IO  uint8_t                        WFT_DAT_SET;        /**< Offset: 0x7A (R/W  8) Command DAT_SET */
  __IO  uint8_t                        WFT_DAT_CLR;        /**< Offset: 0x7B (R/W  8) Command DAT_CLR */
  __IO  uint8_t                        WFT_WNOP;           /**< Offset: 0x7C (R/W  8) Command WNOP */
  __I   uint8_t                        Reserved8[0x02];
  __IO  uint8_t                        WFT_EXT_CMD;        /**< Offset: 0x7F (R/W  8) Command EXT_CMD */
} wft_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMGC00_WFT_COMPONENT_H_ */
